---
kind: property
id: P:Autodesk.Revit.DB.Ellipse.RadiusY
source: html/d5929ba2-80cc-4f18-744c-759c78dcf5f0.htm
---
# Autodesk.Revit.DB.Ellipse.RadiusY Property

Returns the Y vector radius of the ellipse.

## Syntax (C#)
```csharp
public double RadiusY { get; }
```